---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomVolumeNegativeWarn
source: html/04cc8beb-5685-4afa-7a54-cedcda8ea642.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomVolumeNegativeWarn Property

[Room] has a negative volume? [Room] will be ignored in the energy analysis model.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomVolumeNegativeWarn { get; }
```